Revit 2026 API

# SpaceCalculatedHeatingLoad Property

---

Get the Calculated Heating Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CalculatedHeatingLoad { get; }
```
```vb
Public ReadOnly Property CalculatedHeatingLoad As Double
	Get
```
```cpp
public:
property double CalculatedHeatingLoad {
	double get ();
}
```
```fsharp
member CalculatedHeatingLoad : float with get
```

#### Property Value

Double

This property is used to get the Calculated Heating Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace